# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике. Он задумывает два натуральных
# числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого
# Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа.

S = int(input('Введите сумму чисел X + Y: '))
P = int(input('Введите произведение чисел X * Y: '))

for X in range(1000):
    for Y in range(1000):
        if S == X + Y and P == X * Y:
            print(
                f'X ="{X}", Y ="{Y}"')
